In [1]:
# pip matplotlib seaborn

In [10]:
python3 -m pip install --upgrade pip
# python -m pip install seaborn

SyntaxError: invalid syntax (555220037.py, line 1)

In [4]:
# import numpy as np
# import pandas as pd
# import matplotlib.pyplot as plt
import seaborn as sns

ModuleNotFoundError: No module named 'seaborn'

In [8]:
import sys
print(sys.executable)

/usr/local/bin/python

In [7]:
data = "Mall_Customers.csv"
pd.read_csv(data)

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]